neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32H7RS.c

#include <stdlib.h>
#include <stdbool.h>
#include <stdint.h>
#include <math.h>
#include <time.h>

#include "soc.h"

#include "DMA/DMA.h"

#include "NeonRTOS.h"

#ifdef STM32H7RS

#include "DMA_STM32_Index.h"

#include "DMA_STM32.h"

//#include "CAN/Device/STM32/CAN_STM32.h"
#include "I2C/Device/STM32/I2C_Master_STM32.h"
#include "SPI/Device/STM32/SPI_Master_STM32.h"
#include "UART/Device/STM32/UART_STM32.h"

#define DMA_CHANNEL_LOCK(channel_index) if (NeonRTOS_LockObjLock(&DMA_Channel_Mutex[(channel_index)], DMA_WAIT_ALLOCATED_TIMEOUT) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }
#define DMA_CHANNEL_UNLOCK(channel_index) if (NeonRTOS_LockObjUnlock(&DMA_Channel_Mutex[(channel_index)]) != NeonRTOS_OK) { return hwDMA_MutexTimeout; }

static const hwDMA_Channel_Index UART_DMA_Channel_Map[hwUART_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined (UART1_BASE) || defined(USART1_BASE)
    {hwDMA_Channel_Index_0, hwDMA_Channel_Index_1},
#endif
#if defined (UART2_BASE) || defined(USART2_BASE)
    {hwDMA_Channel_Index_2, hwDMA_Channel_Index_3},
#endif
#if defined (UART3_BASE) || defined(USART3_BASE)
    {hwDMA_Channel_Index_4, hwDMA_Channel_Index_5},
#endif
#if defined (UART4_BASE) || defined(USART4_BASE)
    {hwDMA_Channel_Index_6, hwDMA_Channel_Index_7},
#endif
#if defined (UART5_BASE) || defined(USART5_BASE)
    {hwDMA_Channel_Index_8, hwDMA_Channel_Index_9},
#endif
#if defined (UART6_BASE) || defined(USART6_BASE)
    {hwDMA_Channel_Index_10, hwDMA_Channel_Index_11},
#endif
#if defined (UART7_BASE) || defined(USART7_BASE)
    {hwDMA_Channel_Index_12, hwDMA_Channel_Index_13},
#endif
#if defined (UART8_BASE) || defined(USART8_BASE)
    {hwDMA_Channel_Index_14, hwDMA_Channel_Index_15},
#endif
#if defined (LPUART1_BASE)
    {hwDMA_Channel_Index_0, hwDMA_Channel_Index_1},
#endif
};

static const hwDMA_Channel_Index SPI_DMA_Channel_Map[hwSPI_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined(SPI1_BASE)
    {hwDMA_Channel_Index_0, hwDMA_Channel_Index_1},
#endif
#if defined(SPI2_BASE)
    {hwDMA_Channel_Index_2, hwDMA_Channel_Index_3},
#endif
#if defined(SPI3_BASE)
    {hwDMA_Channel_Index_4, hwDMA_Channel_Index_5},
#endif
#if defined(SPI4_BASE)
    {hwDMA_Channel_Index_6, hwDMA_Channel_Index_7},
#endif
#if defined(SPI5_BASE)
    {hwDMA_Channel_Index_8, hwDMA_Channel_Index_9},
#endif
#if defined(SPI6_BASE)
    {hwDMA_Channel_Index_10, hwDMA_Channel_Index_11},
#endif
};

static const hwDMA_Channel_Index I2C_DMA_Channel_Map[hwI2C_Index_MAX][hwDMA_Peripheral_Direction_MAX] =
{
#if defined(I2C1_BASE)
    {hwDMA_Channel_Index_0, hwDMA_Channel_Index_1},
#endif
#if defined(I2C2_BASE)
    {hwDMA_Channel_Index_2, hwDMA_Channel_Index_3},
#endif
#if defined(I2C3_BASE)
    {hwDMA_Channel_Index_4, hwDMA_Channel_Index_5},
#endif
#if defined(I2C4_BASE)
    {hwDMA_Channel_Index_6, hwDMA_Channel_Index_7},
#endif
};

DMA_TypeDef * DMA_Map_Soc_Base(hwDMA_Channel_Index index)
{
    switch(index)
    {
#if defined (GPDMA1_BASE)
#if defined (GPDMA1_Channel0)
        case hwDMA_Channel_Index_0:
#endif
#if defined (GPDMA1_Channel1)
        case hwDMA_Channel_Index_1:
#endif
#if defined (GPDMA1_Channel2)
        case hwDMA_Channel_Index_2:
#endif
#if defined (GPDMA1_Channel3)
        case hwDMA_Channel_Index_3:
#endif
#if defined (GPDMA1_Channel4)
        case hwDMA_Channel_Index_4:
#endif
#if defined (GPDMA1_Channel5)
        case hwDMA_Channel_Index_5:
#endif
#if defined (GPDMA1_Channel6)
        case hwDMA_Channel_Index_6:
#endif
#if defined (GPDMA1_Channel7)
        case hwDMA_Channel_Index_7:
#endif
#if defined (GPDMA1_Channel8)
        case hwDMA_Channel_Index_8:
#endif
#if defined (GPDMA1_Channel9)
        case hwDMA_Channel_Index_9:
#endif
#if defined (GPDMA1_Channel10)
        case hwDMA_Channel_Index_10:
#endif
#if defined (GPDMA1_Channel11)
        case hwDMA_Channel_Index_11:
#endif
#if defined (GPDMA1_Channel12)
        case hwDMA_Channel_Index_12:
#endif
#if defined (GPDMA1_Channel13)
        case hwDMA_Channel_Index_13:
#endif
#if defined (GPDMA1_Channel14)
        case hwDMA_Channel_Index_14:
#endif
#if defined (GPDMA1_Channel15)
        case hwDMA_Channel_Index_15:
#endif
                return GPDMA1;
#endif //GPDMA1_BASE
#if defined (HPDMA1_BASE)
#if defined (HPDMA1_Channel0)
        case hwDMA_Channel_Index_16:
#endif
#if defined (HPDMA1_Channel1)
        case hwDMA_Channel_Index_17:
#endif
#if defined (HPDMA1_Channel2)
        case hwDMA_Channel_Index_18:
#endif
#if defined (HPDMA1_Channel3)
        case hwDMA_Channel_Index_19:
#endif
#if defined (HPDMA1_Channel4)
        case hwDMA_Channel_Index_20:
#endif
#if defined (HPDMA1_Channel5)
        case hwDMA_Channel_Index_21:
#endif
#if defined (HPDMA1_Channel6)
        case hwDMA_Channel_Index_22:
#endif
#if defined (HPDMA1_Channel7)
        case hwDMA_Channel_Index_23:
#endif
#if defined (HPDMA1_Channel8)
        case hwDMA_Channel_Index_24:
#endif
#if defined (HPDMA1_Channel9)
        case hwDMA_Channel_Index_25:
#endif
#if defined (HPDMA1_Channel10)
        case hwDMA_Channel_Index_26:
#endif
#if defined (HPDMA1_Channel11)
        case hwDMA_Channel_Index_27:
#endif
#if defined (HPDMA1_Channel12)
        case hwDMA_Channel_Index_28:
#endif
#if defined (HPDMA1_Channel13)
        case hwDMA_Channel_Index_29:
#endif
#if defined (HPDMA1_Channel4)
        case hwDMA_Channel_Index_30:
#endif
#if defined (HPDMA1_Channel5)
        case hwDMA_Channel_Index_31:
#endif
                return HPDMA1;
#endif
        default:
                break;
    }
    return NULL;
}

DMA_Channel_TypeDef * DMA_Map_Soc_Channel_Base(hwDMA_Channel_Index index)
{
    switch(index)
    {
#if defined (GPDMA1_BASE)
#if defined (GPDMA1_Channel0)
        case hwDMA_Channel_Index_0: return GPDMA1_Channel0;
#endif
#if defined (GPDMA1_Channel1)
        case hwDMA_Channel_Index_1: return GPDMA1_Channel1;
#endif
#if defined (GPDMA1_Channel2)
        case hwDMA_Channel_Index_2: return GPDMA1_Channel2;
#endif
#if defined (GPDMA1_Channel3)
        case hwDMA_Channel_Index_3: return GPDMA1_Channel3;
#endif
#if defined (GPDMA1_Channel4)
        case hwDMA_Channel_Index_4: return GPDMA1_Channel4;
#endif
#if defined (GPDMA1_Channel5)
        case hwDMA_Channel_Index_5: return GPDMA1_Channel5;
#endif
#if defined (GPDMA1_Channel6)
        case hwDMA_Channel_Index_6: return GPDMA1_Channel6;
#endif
#if defined (GPDMA1_Channel7)
        case hwDMA_Channel_Index_7: return GPDMA1_Channel7;
#endif
#if defined (GPDMA1_Channel8)
        case hwDMA_Channel_Index_8: return GPDMA1_Channel8;
#endif
#if defined (GPDMA1_Channel9)
        case hwDMA_Channel_Index_9: return GPDMA1_Channel9;
#endif
#if defined (GPDMA1_Channel10)
        case hwDMA_Channel_Index_10: return GPDMA1_Channel10;
#endif
#if defined (GPDMA1_Channel11)
        case hwDMA_Channel_Index_11: return GPDMA1_Channel11;
#endif
#if defined (GPDMA1_Channel12)
        case hwDMA_Channel_Index_12: return GPDMA1_Channel12;
#endif
#if defined (GPDMA1_Channel13)
        case hwDMA_Channel_Index_13: return GPDMA1_Channel13;
#endif
#if defined (GPDMA1_Channel14)
        case hwDMA_Channel_Index_14: return GPDMA1_Channel14;
#endif
#if defined (GPDMA1_Channel15)
        case hwDMA_Channel_Index_15: return GPDMA1_Channel15;
#endif
#endif
#if defined (HPDMA1_BASE)
#if defined (HPDMA1_Channel0)
        case hwDMA_Channel_Index_16: return HPDMA1_Channel0;
#endif
#if defined (HPDMA1_Channel1)
        case hwDMA_Channel_Index_17: return HPDMA1_Channel1;
#endif
#if defined (HPDMA1_Channel2)
        case hwDMA_Channel_Index_18: return HPDMA1_Channel2;
#endif
#if defined (HPDMA1_Channel3)
        case hwDMA_Channel_Index_19: return HPDMA1_Channel3;
#endif
#if defined (HPDMA1_Channel4)
        case hwDMA_Channel_Index_20: return HPDMA1_Channel4;
#endif
#if defined (HPDMA1_Channel5)
        case hwDMA_Channel_Index_21: return HPDMA1_Channel5;
#endif
#if defined (HPDMA1_Channel6)
        case hwDMA_Channel_Index_22: return HPDMA1_Channel6;
#endif
#if defined (HPDMA1_Channel7)
        case hwDMA_Channel_Index_23: return HPDMA1_Channel7;
#endif
#if defined (HPDMA1_Channel8)
        case hwDMA_Channel_Index_24: return HPDMA1_Channel8;
#endif
#if defined (HPDMA1_Channel9)
        case hwDMA_Channel_Index_25: return HPDMA1_Channel9;
#endif
#if defined (HPDMA1_Channel10)
        case hwDMA_Channel_Index_26: return HPDMA1_Channel10;
#endif
#if defined (HPDMA1_Channel11)
        case hwDMA_Channel_Index_27: return HPDMA1_Channel11;
#endif
#if defined (HPDMA1_Channel12)
        case hwDMA_Channel_Index_28: return HPDMA1_Channel12;
#endif
#if defined (HPDMA1_Channel13)
        case hwDMA_Channel_Index_29: return HPDMA1_Channel13;
#endif
#if defined (HPDMA1_Channel14)
        case hwDMA_Channel_Index_30: return HPDMA1_Channel14;
#endif
#if defined (HPDMA1_Channel15)
        case hwDMA_Channel_Index_31: return HPDMA1_Channel15;
#endif
#endif
        default: break;
    }
    return NULL;
}

