neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32H7RS.c
static void DMA_IRQ_Handler(hwDMA_Channel_Index index)
{
        if(index>=hwDMA_Channel_Index_MAX)
        {
                return;
        }

        HAL_DMA_IRQHandler(&g_dma[index]);
}

#if defined(GPDMA1_BASE)
#if defined(GPDMA1_Channel0)
void GPDMA1_Channel0_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_0); }
#endif
#if defined(GPDMA1_Channel1)
void GPDMA1_Channel1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_1); }
#endif
#if defined(GPDMA1_Channel2)
void GPDMA1_Channel2_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_2); }
#endif
#if defined(GPDMA1_Channel3)
void GPDMA1_Channel3_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_3); }
#endif
#if defined(GPDMA1_Channel4)
void GPDMA1_Channel4_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_4); }
#endif
#if defined(GPDMA1_Channel5)
void GPDMA1_Channel5_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_5); }
#endif
#if defined(GPDMA1_Channel6)
void GPDMA1_Channel6_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_6); }
#endif
#if defined(GPDMA1_Channel7)
void GPDMA1_Channel7_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_7); }
#endif
#if defined(GPDMA1_Channel8)
void GPDMA1_Channel8_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_8); }
#endif
#if defined(GPDMA1_Channel9)
void GPDMA1_Channel9_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_9); }
#endif
#if defined(GPDMA1_Channel10)
void GPDMA1_Channel10_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_10); }
#endif
#if defined(GPDMA1_Channel11)
void GPDMA1_Channel11_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_11); }
#endif
#if defined(GPDMA1_Channel12)
void GPDMA1_Channel12_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_12); }
#endif
#if defined(GPDMA1_Channel13)
void GPDMA1_Channel13_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_13); }
#endif
#if defined(GPDMA1_Channel14)
void GPDMA1_Channel14_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_14); }
#endif
#if defined(GPDMA1_Channel15)
void GPDMA1_Channel15_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_15); }
#endif
#endif // GPDMA1_BASE

#if defined(HPDMA1_BASE)
#if defined(HPDMA1_Channel0)
void HPDMA1_Channel0_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_16); }
#endif
#if defined(HPDMA1_Channel1)
void HPDMA1_Channel1_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_17); }
#endif
#if defined(HPDMA1_Channel2)
void HPDMA1_Channel2_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_18); }
#endif
#if defined(HPDMA1_Channel3)
void HPDMA1_Channel3_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_19); }
#endif
#if defined(HPDMA1_Channel4)
void HPDMA1_Channel4_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_20); }
#endif
#if defined(HPDMA1_Channel5)
void HPDMA1_Channel5_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_21); }
#endif
#if defined(HPDMA1_Channel6)
void HPDMA1_Channel6_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_22); }
#endif
#if defined(HPDMA1_Channel7)
void HPDMA1_Channel7_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_23); }
#endif
#if defined(HPDMA1_Channel8)
void HPDMA1_Channel8_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_24); }
#endif
#if defined(HPDMA1_Channel9)
void HPDMA1_Channel9_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_25); }
#endif
#if defined(HPDMA1_Channel10)
void HPDMA1_Channel10_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_26); }
#endif
#if defined(HPDMA1_Channel11)
void HPDMA1_Channel11_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_27); }
#endif
#if defined(HPDMA1_Channel12)
void HPDMA1_Channel12_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_28); }
#endif
#if defined(HPDMA1_Channel13)
void HPDMA1_Channel13_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_29); }
#endif
#if defined(HPDMA1_Channel14)
void HPDMA1_Channel14_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_30); }
#endif
#if defined(HPDMA1_Channel15)
void HPDMA1_Channel15_IRQHandler(void){ DMA_IRQ_Handler(hwDMA_Channel_Index_31); }
#endif
#endif // HPDMA1_BASE

void DMA_Clock_Enable()
{
#if defined (GPDMA1_BASE)
         __HAL_RCC_GPDMA1_CLK_ENABLE();
#endif //GPDMA1_BASE

#if defined (HPDMA1_BASE)
        __HAL_RCC_HPDMA1_CLK_ENABLE();
#endif //HPDMA1_BASE
}

void DMA_Clock_Disable()
{
#if defined (GPDMA1_BASE)
        __HAL_RCC_GPDMA1_CLK_DISABLE();
#endif //GPDMA1_BASE

#if defined (HPDMA1_BASE)
        __HAL_RCC_HPDMA1_CLK_DISABLE();
#endif //HPDMA1_BASE
}

hwDMA_OpResult DMA_NVIC_Init(hwDMA_Channel_Index channel_index)
{
        if(channel_index>=hwDMA_Channel_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(DMA_Channel_Init_Status[channel_index]==true)
        {
                return hwDMA_OK;
        }

        switch(channel_index)
        {
#if defined(GPDMA1_BASE)
#if defined(GPDMA1_Channel0)
                case hwDMA_Channel_Index_0:
                        HAL_NVIC_SetPriority(GPDMA1_Channel0_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel0_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_SetPriority(GPDMA1_Channel1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel1_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel2)
                case hwDMA_Channel_Index_2:
                        HAL_NVIC_SetPriority(GPDMA1_Channel2_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel2_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel3)
                case hwDMA_Channel_Index_3:
                        HAL_NVIC_SetPriority(GPDMA1_Channel3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel3_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel4)
                case hwDMA_Channel_Index_4:
                        HAL_NVIC_SetPriority(GPDMA1_Channel4_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel4_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel5)
                case hwDMA_Channel_Index_5:
                        HAL_NVIC_SetPriority(GPDMA1_Channel5_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel5_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel6)
                case hwDMA_Channel_Index_6:
                        HAL_NVIC_SetPriority(GPDMA1_Channel6_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel6_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel7)
                case hwDMA_Channel_Index_7:
                        HAL_NVIC_SetPriority(GPDMA1_Channel7_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel7_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel8)
                case hwDMA_Channel_Index_8:
                        HAL_NVIC_SetPriority(GPDMA1_Channel8_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel8_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel9)
                case hwDMA_Channel_Index_9:
                        HAL_NVIC_SetPriority(GPDMA1_Channel9_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel9_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel10)
                case hwDMA_Channel_Index_10:
                        HAL_NVIC_SetPriority(GPDMA1_Channel10_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel10_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel11)
                case hwDMA_Channel_Index_11:
                        HAL_NVIC_SetPriority(GPDMA1_Channel11_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel11_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel12)
                case hwDMA_Channel_Index_12:
                        HAL_NVIC_SetPriority(GPDMA1_Channel12_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel12_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel13)
                case hwDMA_Channel_Index_13:
                        HAL_NVIC_SetPriority(GPDMA1_Channel13_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel13_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel14)
                case hwDMA_Channel_Index_14:
                        HAL_NVIC_SetPriority(GPDMA1_Channel14_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel14_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel15)
                case hwDMA_Channel_Index_15:
                        HAL_NVIC_SetPriority(GPDMA1_Channel15_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(GPDMA1_Channel15_IRQn);
                        break;
#endif
#endif // GPDMA1_BASE


#if defined(HPDMA1_BASE)
#if defined(HPDMA1_Channel0)
                case hwDMA_Channel_Index_16:
                        HAL_NVIC_SetPriority(HPDMA1_Channel0_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel0_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel1)
                case hwDMA_Channel_Index_17:
                        HAL_NVIC_SetPriority(HPDMA1_Channel1_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel1_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel2)
                case hwDMA_Channel_Index_18:
                        HAL_NVIC_SetPriority(HPDMA1_Channel2_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel2_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel3)
                case hwDMA_Channel_Index_19:
                        HAL_NVIC_SetPriority(HPDMA1_Channel3_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel3_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel4)
                case hwDMA_Channel_Index_20:
                        HAL_NVIC_SetPriority(HPDMA1_Channel4_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel4_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel5)
                case hwDMA_Channel_Index_21:
                        HAL_NVIC_SetPriority(HPDMA1_Channel5_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel5_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel6)
                case hwDMA_Channel_Index_22:
                        HAL_NVIC_SetPriority(HPDMA1_Channel6_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel6_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel7)
                case hwDMA_Channel_Index_23:
                        HAL_NVIC_SetPriority(HPDMA1_Channel7_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel7_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel8)
                case hwDMA_Channel_Index_24:
                        HAL_NVIC_SetPriority(HPDMA1_Channel8_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel8_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel9)
                case hwDMA_Channel_Index_25:
                        HAL_NVIC_SetPriority(HPDMA1_Channel9_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel9_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel10)
                case hwDMA_Channel_Index_26:
                        HAL_NVIC_SetPriority(HPDMA1_Channel10_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel10_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel11)
                case hwDMA_Channel_Index_27:
                        HAL_NVIC_SetPriority(HPDMA1_Channel11_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel11_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel12)
                case hwDMA_Channel_Index_28:
                        HAL_NVIC_SetPriority(HPDMA1_Channel12_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel12_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel13)
                case hwDMA_Channel_Index_29:
                        HAL_NVIC_SetPriority(HPDMA1_Channel13_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel13_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel14)
                case hwDMA_Channel_Index_30:
                        HAL_NVIC_SetPriority(HPDMA1_Channel14_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel14_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel15)
                case hwDMA_Channel_Index_31:
                        HAL_NVIC_SetPriority(HPDMA1_Channel15_IRQn, DMA_IRQ_NVIC_PRIORITY, DMA_IRQ_NVIC_SUB_PRIORITY);
                        HAL_NVIC_EnableIRQ(HPDMA1_Channel15_IRQn);
                        break;
#endif
#endif // HPDMA1_BASE
        }

