neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32H7RS.c
        return hwDMA_OK;
}

hwDMA_OpResult DMA_NVIC_DeInit(hwDMA_Channel_Index channel_index)
{
        if(channel_index>=hwDMA_Channel_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        switch(channel_index)
        {
#if defined(GPDMA1_BASE)
#if defined(GPDMA1_Channel0)
                case hwDMA_Channel_Index_0:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel0_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel1)
                case hwDMA_Channel_Index_1:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel1_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel2)
                case hwDMA_Channel_Index_2:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel2_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel3)
                case hwDMA_Channel_Index_3:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel3_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel4)
                case hwDMA_Channel_Index_4:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel4_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel5)
                case hwDMA_Channel_Index_5:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel5_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel6)
                case hwDMA_Channel_Index_6:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel6_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel7)
                case hwDMA_Channel_Index_7:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel7_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel8)
                case hwDMA_Channel_Index_8:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel8_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel9)
                case hwDMA_Channel_Index_9:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel9_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel10)
                case hwDMA_Channel_Index_10:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel10_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel11)
                case hwDMA_Channel_Index_11:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel11_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel12)
                case hwDMA_Channel_Index_12:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel12_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel13)
                case hwDMA_Channel_Index_13:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel13_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel14)
                case hwDMA_Channel_Index_14:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel14_IRQn);
                        break;
#endif
#if defined(GPDMA1_Channel15)
                case hwDMA_Channel_Index_15:
                        HAL_NVIC_DisableIRQ(GPDMA1_Channel15_IRQn);
                        break;
#endif
#endif // GPDMA1_BASE

#if defined(HPDMA1_BASE)
#if defined(HPDMA1_Channel0)
                case hwDMA_Channel_Index_16:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel0_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel1)
                case hwDMA_Channel_Index_17:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel1_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel2)
                case hwDMA_Channel_Index_18:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel2_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel3)
                case hwDMA_Channel_Index_19:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel3_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel4)
                case hwDMA_Channel_Index_20:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel4_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel5)
                case hwDMA_Channel_Index_21:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel5_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel6)
                case hwDMA_Channel_Index_22:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel6_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel7)
                case hwDMA_Channel_Index_23:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel7_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel8)
                case hwDMA_Channel_Index_24:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel8_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel9)
                case hwDMA_Channel_Index_25:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel9_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel10)
                case hwDMA_Channel_Index_26:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel10_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel11)
                case hwDMA_Channel_Index_27:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel11_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel12)
                case hwDMA_Channel_Index_28:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel12_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel13)
                case hwDMA_Channel_Index_29:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel13_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel14)
                case hwDMA_Channel_Index_30:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel14_IRQn);
                        break;
#endif
#if defined(HPDMA1_Channel15)
                case hwDMA_Channel_Index_31:
                        HAL_NVIC_DisableIRQ(HPDMA1_Channel15_IRQn);
                        break;
#endif
#endif // HPDMA1_BASE
        }

